<?php
    // 2.สามารถเปลี่ยนชื่อได้ set ใหม่เลย
    // setcookie('username', 'Asmat', time() + (86400 * 30));//1 เดือน
    // 3.สามารถลบชื่อได้
    // setcookie('username', 'Asmat', time() - 3600);
    // 4.ถ้าหากอยากเช็คว่ามีผู้ใช้นี้ในคุกกี้ไหม? ให้มันนับ
    if(count($_COOKIE) > 0) {
        echo 'มีข้อมูลผู้ใช้คนนี้ ' . count($_COOKIE) . ' ถูกบันทึกไว้เรียบร้อย <br>';
    } else {
        echo 'ไม่มีข้อมูลผู้ใช้คนนี้ <br>';
    }
    // 1.ถ้าเกิดมีชื่อที่คนป้อนก็จะแสดงชื่อผู้ใช้....
    if(isset($_COOKIE['username'])) {
        echo 'ชื่อผู้ใช้ ' . $_COOKIE['username'] . ' ถูกเซ็ต <br>';
    } else {
        echo 'ไม่มีชื่อผู้ใช้คนนี้';
    }
?>